renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
/*
 * this next line disables the entire HardwareUart.cpp,
 * this is so I can support Attiny series and any other chip without a uart
 */

#include "HardwareUart.h"

/*
 * Define constants and variables for buffering incoming serial data.  We're
 * using a ring buffer (I think), in which head is the index of the location
 * to which to write the next incoming character and tail is the index of the
 * location from which to read.
 */
#define SERIAL_BUFFER_SIZE 256

void serialEventRun(void)
{

}

fInterruptFunc_t uart_receive_callback_table[3] __attribute__((weak));
fInterruptFunc_t uart_transmit_callback_table[3] __attribute__((weak));

// Constructors ////////////////////////////////////////////////////////////////

/**********************************************************************************************************************
 * Function Name: HardwareUart::HardwareUart
 * Description  : Constructor
 * Arguments    : ubrrh - (Not Used)
 *              : ubrrl - (Not Used)
 *              : ucsra - (Not Used)
 *              : ucsrb - (Not Used)
 *              : ucsrc - (Not Used)
 *              : udr   - (Not Used)
 *              : rxen  - UART channel
 *              : txen  - (Not Used)
 *              : rxcie - (Not Used)
 *              : udrie - (Not Used)
 *              : u2x   - (Not Used)
 * Return Value : void
 *********************************************************************************************************************/
HardwareUart::HardwareUart(
  volatile uint8_t *ubrrh, volatile uint8_t *ubrrl,
  volatile uint8_t *ucsra, volatile uint8_t *ucsrb,
  volatile uint8_t *ucsrc, volatile uint8_t *udr,
  uint8_t rxen, uint8_t txen, uint8_t rxcie, uint8_t udrie, uint8_t u2x)
{
    _urt_channel    = rxen;
    _rx_buffer_head = 0;
    _rx_buffer_tail = 0;
    _tx_buffer_head = 0;
    _tx_buffer_tail = 0;
    _rx_buf_size    = 0;
    _tx_buf_size    = 0;
    _rx_buffer      = 0;
    _tx_buffer      = 0;
    transmitting    = 0;
    receive_buffer  = 0;
}


/**********************************************************************************************************************
 * Function Name: HardwareUart::HardwareUart
 * Description  : Constructor
 * Arguments    : rxen - UART channel
 * Return Value : void
 *********************************************************************************************************************/
HardwareUart::HardwareUart(uint8_t rxen)
{
    _urt_channel   = rxen;
    _rx_buffer_head = 0;
    _rx_buffer_tail = 0;
    _tx_buffer_head = 0;
    _tx_buffer_tail = 0;
    _rx_buf_size    = 0;
    _tx_buf_size    = 0;
    _rx_buffer      = 0;
    _tx_buffer      = 0;
    transmitting    = 0;
    receive_buffer  = 0;
}

// Public Methods //////////////////////////////////////////////////////////////

/**********************************************************************************************************************
 * Function Name: HardwareUart::begin
 * Description  : Initialize and configure the serial port.
 * Arguments    : baud   - baud rate
 *              :          { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::begin(unsigned long baud)
{
    begin(baud, SERIAL_8N1);
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::begin
 * Description  : Initialize and configure the serial port.
 * Arguments    : baud   - baud rate
 *              :          { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 *              : config - serial port setting
 *               :         SERIAL_{ 8, 7 }{ N, E }{ 1, 2 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::begin(unsigned long baud, uint16_t config){
    begin(baud, config, SERIAL_BUFFER_SIZE, SERIAL_BUFFER_SIZE);
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::begin
 * Description  : Initialize and configure the serial port.
 * Arguments    : baud   - baud rate
 *              :          { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 *              : rx_buf - receive  buffer size
 *              : tx_buf - transmit buffer size
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::begin(unsigned long baud, int rx_buf, int tx_buf){
    begin(baud, SERIAL_8N1, rx_buf, tx_buf);
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::begin
 * Description  : Initialize and configure the serial port.
 * Arguments    : baud   - baud rate
 *              :          { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 *              : config - serial port setting
 *               :         SERIAL_{ 8, 7 }{ N, E }{ 1, 2 }
 *              : rx_buf - receive  buffer size
 *              : tx_buf - transmit buffer size
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::begin(unsigned long baud, uint16_t config, int rx_buf, int tx_buf)
{
    /* Initialize Unit */
    /* begin executed. end call */
    if ((0 != _rx_buffer) || (0 != _tx_buffer)){
        return;
    }
    if ((1 == rx_buf) || (1 == tx_buf)){
        return;
    }
    _rx_buffer = (uint8_t *)malloc((size_t)(rx_buf * (int)sizeof(uint8_t)));
    if (0 == _rx_buffer){
        _rx_buf_size = 0;
        _tx_buf_size = 0;
        return;
    }
    _tx_buffer = (uint8_t *)malloc((size_t)(tx_buf * (int)sizeof(uint8_t)));
    if (0 == _tx_buffer){
        free((uint8_t *)_rx_buffer);
        _rx_buffer = 0;
        _rx_buf_size = 0;
        _tx_buf_size = 0;
        return;
    }
    _rx_buf_size = rx_buf;
    _tx_buf_size = tx_buf;
    _rx_buffer_head = 0;
    _rx_buffer_tail = 0;
    _tx_buffer_head = 0;
    _tx_buffer_tail = 0;

    switch (_urt_channel)
    {
        case 0:
#if (UART_CHANNEL==0)
            R_Config_UART0_Create();
            Set_Baudrate(baud);
            Set_SerialPort(SERIAL_TXD0,SERIAL_RXD0);
            Set_Config(config);
            R_Config_UART0_Start();
            R_Config_UART0_Receive((uint8_t * const)&receive_buffer,1);
#endif /* UART_CHANNEL==0 */
            break;
        case 1:
#if (UART1_CHANNEL==1)
			R_Config_UART1_Create();
			Set_Baudrate(baud);
			Set_SerialPort(SERIAL_TXD1,SERIAL_RXD1);
			Set_Config(config);
			R_Config_UART1_Start();
			R_Config_UART1_Receive((uint8_t * const)&receive_buffer,1);
#endif /* UART1_CHANNEL==1 */
            break;
        case 2:
#if (UART2_CHANNEL==2)
            R_Config_UART2_Create();
            Set_Baudrate(baud);
            Set_SerialPort(SERIAL_TXD2,SERIAL_RXD2);
            Set_Config(config);
            R_Config_UART2_Start();
            R_Config_UART2_Receive((uint8_t * const)&receive_buffer,1);
#endif /* UART2_CHANNEL==2 */
            break;
        case 3:
            break;
        default :
            /* Do nothing */
            break;
    }
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::end
 * Description  : Terminate the serial port processing.
 * Arguments    : -
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::end()
{
    switch (_urt_channel)
    {
    case 0:
#if (UART_CHANNEL == 0 )
        R_Config_UART0_Stop();
#endif /* (UART_CHANNEL == 0 ) */
        break;
    case 1:
#if (UART1_CHANNEL == 1 )
		R_Config_UART1_Stop();
#endif /* (UART1_CHANNEL == 1 ) */
        break;
    case 2:
#if (UART2_CHANNEL == 2 )
        R_Config_UART2_Stop();
#endif /* (UART2_CHANNEL == 2 ) */
        break;
    case 3:
        break;
        }
    if(_rx_buffer!= 0)
    {
        free((uint8_t *)_rx_buffer);
        _rx_buffer = 0;
    }
    if(_tx_buffer!= 0)
    {
        free((uint8_t *)_tx_buffer);
        _tx_buffer = 0;
    }
    _rx_buffer_head = 0;
    _rx_buffer_tail = 0;
    _tx_buffer_head = 0;
    _tx_buffer_tail = 0;
    _rx_buf_size = 0;
    _tx_buf_size = 0;
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::available
 * Description  : Get the number of readable data bytes of received data.
 * Arguments    : -
 * Return Value : size of readable data
 *********************************************************************************************************************/
int HardwareUart::available(void)
{
    int head = 0;
    int tail = 0;
    noInterrupts();
    head = _rx_buffer_head;
    tail = _rx_buffer_tail;
    interrupts();
    if (head >= tail) return head - tail;
    return (_rx_buf_size - tail + head );
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::peek
 * Description  : Read received data by 1 byte and do not change the buffer position.
 * Arguments    : -
 * Return Value : -1    - no read data
 *              : other - read data
 *********************************************************************************************************************/
int HardwareUart::peek(void)
{
  if (_rx_buffer_head == _rx_buffer_tail) {
    return -1;
  } else {
    return _rx_buffer[_rx_buffer_tail];
  }
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::read
 * Description  : Read received data by 1 byte and advance the buffer position by 1 byte.
 * Arguments    : -
 * Return Value : -1    - no read data
 *              : other - read data
 *********************************************************************************************************************/
int HardwareUart::read(void)
{
    /* if the head isn't ahead of the tail, we don't have any characters */
    noInterrupts();
    if (_rx_buffer_head == _rx_buffer_tail) {
        interrupts();
        return -1;
    }
    unsigned char c = _rx_buffer[_rx_buffer_tail];
    _rx_buffer_tail = (_rx_buffer_tail + 1) % _rx_buf_size;
    interrupts();

    return c;
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::flush
 * Description  : Wait for all data transmission in the transmission buffer to be completed.
 * Arguments    : -
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::flush()
{
  /* buffer is none */
  if (0 == _tx_buf_size || 0 == _tx_buffer){
    return;
  }
  if (_urt_channel == 0) {
    while (SSR00 & 0x0060) {  /* check TSF00 and BFF00 */
      ;
    }
  }
  else if (_urt_channel == 1) {
    while (SSR02 & 0x0060) {  /* check TSF02 and BFF02 */
      ;
    }
  }
  else if (_urt_channel == 2) {
    while (SSR10 & 0x0060) {  /* check TSF10 and BFF10 */
      ;
    }
  }
  while(_tx_buf_size-1!=availableForWrite())
  {
    NOP();
  }
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::UART_Send
 * Description  : Transmit data to the target serial port (actual implementation of write operation).
 * Arguments    : c - transmission data
 * Return Value : -1    - write failed with the transmission buffer overflow
 *              : other - written data size
 *********************************************************************************************************************/
size_t HardwareUart::UART_Send(uint8_t c)
{
    MD_STATUS err = MD_OK;
    int i;
    uint8_t isp;
    size_t ret = -1;

    /* buffer is none */
    if (0 == _tx_buf_size){
//        return -1;
    	return ret;
    }

    isp = (uint8_t)GET_PSW_ISP();

    noInterrupts();
    if(_tx_buffer_tail == _tx_buffer_head){
        /* Unsent */
        int head = (_tx_buffer_head + 1);
        i = (_tx_buffer_head + 1) % _tx_buf_size;
        _tx_buffer[_tx_buffer_head] = c;
        _tx_buffer_head = i;
        interrupts();

        switch (_urt_channel)
        {
            case 0:
                if((SSR00 & 0x20) != 0)/*BFF00*/
                {
                    return -1;
                }
                err = R_Config_UART0_Send((uint8_t * const)&c,1);
                break;
            case 1:
				if((SSR02 & 0x20) != 0)/*BFF00*/
				{
					return -1;
				}
				err = R_Config_UART1_Send((uint8_t * const)&c,1); 
                break;
            case 2:
                if((SSR10 & 0x20) != 0)/*BFF00*/
                {
                    return -1;
                }
                err = R_Config_UART2_Send((uint8_t * const)&c,1);
                break;
            case 3:
                break;
        }
    }
    else
    {
        /* only buffer copy during transmission process */
        i = (_tx_buffer_head + 1) % _tx_buf_size;
        if(i == _tx_buffer_tail)
        {
            /* buffer over */
            if(ISP_LEVEL_3 == isp)
            {
                /* When called from main program(setup() or loop() */
                interrupts();
                while(i == _tx_buffer_tail)
                {
                    ;
                }
                noInterrupts();
            }
            else
            {
                /* When called from interuupt function (ex. callback routine for periodic processing */
                switch (_urt_channel)
                {
                    case 0:
        #if ( UART_CHANNEL == 0 )
                        while((SSR00 & 0x20) != 0)/*BFF00*/
                        {
                            ;
                        }
                        STIF0 = 0;
        #endif /* ( UART_CHANNEL == 0 ) */
                        break;
                    case 1:
		#if ( UART1_CHANNEL == 1 )
						while((SSR02 & 0x20) != 0)/*BFF00*/
						{
							;
						}
					    STIF1 = 0;
		#endif /* ( UART1_CHANNEL == 1 ) */
                        break;
                    case 2:
        #if ( UART2_CHANNEL == 2 )
                        while((SSR10 & 0x20) != 0)/*BFF00*/
                        {
                            ;
                        }
                        STIF2 = 0;
        #endif /* ( UART2_CHANNEL == 2 ) */
                        break;
                    case 3:
                        break;
                }
                Set_Char_Serial_from_buf(_urt_channel);
                if(0 != uart_transmit_callback_table[_urt_channel])
                {
                    (*uart_transmit_callback_table[_urt_channel])();
                }
            }
//          return -1;
        }
        _tx_buffer[_tx_buffer_head] = c;
        _tx_buffer_head = i;
        interrupts();
    }
    if(err == MD_OK){
        return 1;
    }
	return ret;
//	return -1;
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::write
 * Description  : Transmit data to the target serial port.
 * Arguments    : c - transmission data
 * Return Value : -1    - write failed with the transmission buffer overflow
 *              : other - written data size
 *********************************************************************************************************************/

