renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
size_t HardwareUart::write(uint8_t c)
{
    size_t err = 0;
    err = UART_Send(c);
    return err;
}


/**********************************************************************************************************************
 * Function Name: HardwareUart::availableForWrite
 * Description  : Get the number of available transmit buffer space for write.
 * Arguments    : -
 * Return Value : size of transmit buffer free space
 *********************************************************************************************************************/
int HardwareUart::availableForWrite(void)
{
  int head = 0;
  int tail = 0;
  noInterrupts();
  head = _tx_buffer_head;
  tail = _tx_buffer_tail;
  interrupts();
  if (head >= tail) return _tx_buf_size - 1 - head + tail;
  return (tail - head - 1);
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::availableForRead
 * Description  : Get the number of available receive buffer space for read.
 * Arguments    : -
 * Return Value : size of receive buffer free space
 *********************************************************************************************************************/
int HardwareUart::availableForRead(void)
{
  int head = 0;
  int tail = 0;
  noInterrupts();
  head = _rx_buffer_head;
  tail = _rx_buffer_tail;
  interrupts();
  if (head >= tail) return _rx_buf_size - 1 - head + tail;
  return (tail - head - 1);

}

HardwareUart::operator bool() {
    return true;
}

/* Load Send data from Send Buffer & Start New Send Function */
/**********************************************************************************************************************
 * Function Name: HardwareUart::load_char
 * Description  : Extract 1 byte from the transmit buffer and send it.
 *              : Called from the transmission complete interrupt handler.
 *              : Unavailable for the other purpose.
 * Arguments    :  -
 * Return Value :  -
 *********************************************************************************************************************/
void HardwareUart::load_char(void){
    int i = (_tx_buffer_tail + 1) % _tx_buf_size;
    _tx_buffer_tail = i;
    if (i != _tx_buffer_head) {
        uint8_t send_buffer  = _tx_buffer[i];
        switch (_urt_channel)
        {
        case 0:
#if (UART_CHANNEL == 0)
            R_Config_UART0_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
			R_Config_UART1_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            R_Config_UART2_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
            break;
        }
    }
}


/* Store Received data to Receive Buffer & Start New Receive Function */
/**********************************************************************************************************************
 * Function Name: HardwareUart::store_char
 * Description  : Store 1 byte of the last received data in the receive buffer
 *              : and continue the receive process for the following bytes.
 *              : Called from the receive complete interrupt handler.
 *              : Unavailable for the other purpose.
 * Arguments    : -
 * Return Value : -
 *********************************************************************************************************************/
void HardwareUart::store_char(void){
    store_char(receive_buffer);
    receive_buffer = 0;
    switch (_urt_channel)
    {
    case 0:
    #if (UART_CHANNEL == 0)
        R_Config_UART0_Receive((uint8_t * const)&receive_buffer,1);
    #endif /* (UART_CHANNEL == 0) */
        break;
    case 1:
	#if (UART1_CHANNEL == 1)
		R_Config_UART1_Receive((uint8_t * const)&receive_buffer,1);
	#endif /* (UART1_CHANNEL == 1) */
        break;
    case 2:
    #if (UART2_CHANNEL == 2)
        R_Config_UART2_Receive((uint8_t * const)&receive_buffer,1);
    #endif /* (UART2_CHANNEL == 2) */
        break;
        break;
    }
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::store_char
 * Description  : Store 1 byte of the last received data in the receive buffer
 *              : and continue the receive process for the following bytes.
 *              : Make sure to disable interrupts before calling this from outside of the interrupt handler.
 * Arguments    : c - byte to store
 * Return Value : -
 *********************************************************************************************************************/
void HardwareUart::store_char(unsigned char c){
  int i = (_rx_buffer_head + 1) % _rx_buf_size;
  if (i != _rx_buffer_tail) {
    _rx_buffer[_rx_buffer_head] = c;
    _rx_buffer_head = i;
  }
}

/* Add for RL78/G23 */
/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_Baudrate
 * Description  : Set baud rate for the serial port.
 * Arguments    : baudrate - baud rate
 *              :            { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_Baudrate(unsigned long baurate)
{
    uint32_t fclk_frequency;
    uint32_t  peri_clk    ;
    uint8_t  sdr     ;
    uint16_t tmp_sdr ;
    uint8_t  prs = 0U;
    fclk_frequency = R_BSP_GetFclkFreqHz();

    peri_clk    = (fclk_frequency) ; /* SPSmk0\[3:0] = 0x0 */

    tmp_sdr = (uint16_t)(((peri_clk/baurate) >> 1) -1) ;
    while(0x007F<tmp_sdr)
    {
        prs++;
        peri_clk = (peri_clk >> 1);
        tmp_sdr  = (uint16_t)(((peri_clk/baurate) >> 1) -1) ;
    }

    sdr     = (uint8_t)(tmp_sdr & 0x007F) ;

    switch (_urt_channel)
    {
        case 0:
#if ( UART_CHANNEL == 0 )
            ST0  &= 0xFC;
            SS0  &= 0xFC;
            SPS0 &= (0x00F0) ;
            SPS0 |=  prs ;
            SDR00 = ((uint16_t)sdr) << 9 ;
            SDR01 = ((uint16_t)sdr) << 9 ;
            SS0  |= 0x03;
            ST0  |= 0x03;
#endif /* ( UART_CHANNEL == 0 ) */
            break;
        case 1:
#if ( UART1_CHANNEL == 1 )
			ST0  &= 0xF3;
			SS0  &= 0xF3;
			SPS0 &= (0x000F) ;
			SPS0 |= ((uint16_t)prs << 4);
			SDR02 = ((uint16_t)sdr) << 9 ;
			SDR03 = ((uint16_t)sdr) << 9 ;
			SS0  |= 0x0C;
			ST0  |= 0x0C;
#endif /* ( UART1_CHANNEL == 1 ) */
            break;
        case 2:
#if ( UART2_CHANNEL == 2 )
            ST1  &= 0xFC;
            SS1  &= 0xFC;
            SPS1 &= (0x00F0) ;
            SPS1 |= prs ;
            SDR10 = ((uint16_t)sdr) << 9 ;
            SDR11 = ((uint16_t)sdr) << 9 ;
            SS1  |= 0x03;
            ST1  |= 0x03;
#endif /* ( UART2_CHANNEL == 2 ) */
            break;
        case 3:
            break;
        default :
            /* Do nothing */
            break;
    }
}

#ifdef __RL78__
/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_Config
 * Description  : Set the serial data length, parity, and stop bit.
 * Arguments    : config - serial port setting
 *               :         SERIAL_{ 8, 7 }{ N, E }{ 1, 2 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_Config(uint16_t config )
{
    switch (_urt_channel)
    {
        /* Rewriting prohibited when SEmn = 1 / Set_Config is called between R_Config_UART0_Create () and R_Config_UART0_Start (), so SEmn = 0*/
        case 0:
        {
        /* SCR00 16bit*/
#if ( UART_CHANNEL == 0 )
        unsigned short SCR00data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |0x4 |_0080_SAU_LSB | config;
        /* When sending, _0000_SAU_INTSRE_MASK :EOCmn = 0*/
        unsigned short SCR01data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |0x4 |_0080_SAU_LSB |config;
        /* _0400_SAU_INTSRE_ENABLE: EOCmn = 1 Allow the occurrence of the error interrupt INTSREx */

        /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
        SCR01data &= 0xFFDF;
        SCR01data |= 0x0010;

        SCR00 = SCR00data;
        SCR01 = SCR01data;
#endif /* ( UART_CHANNEL == 0 ) */
        }
        break;

        case 1:
        {
#if ( UART1_CHANNEL == 1 )
		unsigned short SCR02data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |0x4 |_0080_SAU_LSB |config;
		unsigned short SCR03data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |0x4 |_0080_SAU_LSB |config;
		/* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
		SCR03data &= 0xFFDF;
		SCR03data |= 0x0010;

		SCR02 = SCR02data;
		SCR03 = SCR03data;
#endif /* ( UART1_CHANNEL == 1 ) */
        }
        break;
        case 2:
        {
#if ( UART2_CHANNEL == 2 )
            unsigned short SCR10data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |0x4 |_0080_SAU_LSB |config;
            unsigned short SCR11data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |0x4 |_0080_SAU_LSB |config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR11data &= 0xFFDF;
            SCR11data |= 0x0010;
            SCR10 = SCR10data;
            SCR11 = SCR11data;
#endif /* ( UART2_CHANNEL == 2 ) */
        }
        break;
        case 3:
        {

