renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
        }
        break;
    }
}
/**********************************************************************************************************************
 End of function Set_Config
 *********************************************************************************************************************/
#endif /* __RL78__ */

/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_SerialPort
 * Description  : Set serial port pins for the target port.
 * Arguments    : txd_pin - transmit pin no.
 *              : rxd_pin - receive  pin no.
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_SerialPort(uint8_t txd_pin,uint8_t rxd_pin)
{
    //PinTableType* p;
    //PinTableType pin_tbl;
    //p = (PinTableType*)&pin_tbl;


    const PinTableType ** pp;
    PinTableType * p;

    /* Set RxD pin */
    //getPinTable(rxd_pin,p);
    pp = &pinTablelist[rxd_pin];
    p = (PinTableType *)*pp;
    /* Set PM Register for Input */
    *p->portModeRegisterAddr |=  (unsigned long)(0x1 << p->bit);

    /* Set PMCA Register */
    if (0!=p->pmca){
      *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }

    /* Set PMCT Register */
    if (0!=p->pmct){
      *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }

    /* Set PMCE Register for Output */
#if defined(G23_FPB)
    if (0!=p->pmce){
      *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde){
      CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB

    /* Set TxD pin */
    //getPinTable(txd_pin,p);
    pp = &pinTablelist[txd_pin];
    p = (PinTableType *)*pp;
    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce){
      *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB

    /* Set P Register for Set "H" Output Port*/
    *p->portRegisterAddr |= (unsigned long)(0x1 << p->bit);

    /* Set PM Register for Output */
    *p->portModeRegisterAddr &= (unsigned long)~(0x1 << p->bit);

    /* Set PMCA Register */
    if (0!=p->pmca){
      *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }

    /* Set PMCT Register */
    if (0!=p->pmct){
      *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }

    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce){
      *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde){
      CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB
}


void HardwareUart::setReceiveCallback(void (*userFunc)(void))
{
    uart_receive_callback_table[_urt_channel] = userFunc;
}
void HardwareUart::setTransmitCallback(void (*userFunc)(void))
{
    uart_transmit_callback_table[_urt_channel] = userFunc;
}

extern "C" {
/**********************************************************************************************************************
 * Function Name: Set_Char_Serial_to_buf
 * Description  : Store the received data in the buffer.
 *              : Called from the receive interrupt handler.
 * Arguments    : chn - UART channel
 * Return Value : void
 *********************************************************************************************************************/
void Set_Char_Serial_to_buf(uint8_t chn)
{
    switch (chn)
    {
        case 0:
#if (UART_CHANNEL == 0)
            Serial.store_char();
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
			Serial1.store_char();
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            Serial2.store_char();
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
            break;
    }
}

/**********************************************************************************************************************
 * Function Name: Set_Char_Serial_from_buf
 * Description  : Load write data from the buffer.
 * Arguments    : chn  - UART_CHANNEL
 * Return Value : void         -
 *********************************************************************************************************************/

void Set_Char_Serial_from_buf(uint8_t chn)
{
    switch (chn)
    {
        case 0:
#if (UART_CHANNEL == 0)
            Serial.load_char();
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
			Serial1.load_char();
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            Serial2.load_char();
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
            break;
    }
}

}

// Preinstantiate Objects //////////////////////////////////////////////////////

#if ( UART_CHANNEL == 0 )
  HardwareUart Serial(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
#endif /* ( UART_CHANNEL == 0 ) */
#if ( UART1_CHANNEL == 1 )
    HardwareUart Serial1(0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0);
#endif /* ( UART1_CHANNEL == 1 ) */
#if ( UART2_CHANNEL == 2 )
    HardwareUart Serial2(0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0);
#endif /* ( UART2_CHANNEL == 2 ) */


